{"nodes":[{"node":{"email":"haileylwengle@gmail.com","instructor":"frederick","link":"https://haileywengledesign.com/","desc":"The book “The Modern Interaction of Colour” follows the study of colour perception expressed by Josef Albers, but with a modern twist. Although he brought a phenomenon to the art world, the way in which he teaches his students has aged. While completing colour experiments, Albers encourages the reader to use paper colour chips and cut-outs from magazines.\r\n\r\nAlthough this can still be done, the advancement in technology that was non-existent at his time can be used to explore an even wider range of colour interaction possibilities.\r\n\r\nThe aim of this book - like Albers - is to develop through experience, an eye for colour. Putting theory aside, the art of practice takes the forefront and a new way of experiencing colour emerges.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_8985%20copy.jpg?itok=rkCC8_Ia, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_8989%20copy.jpg?itok=8OFGsGgu, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_8991.jpg?itok=ezPv5UTE, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_8993%20copy.jpg?itok=2I_jwCdB","tags":"Book Design","project":"The Modern Interaction of Colour","name":"Hailey Wengle","nid":"222","profile":""}},{"node":{"email":"sara.syme.design@gmail.com","instructor":"frederick","link":"http://symedesign.myportfolio.com","desc":"Annie Leonard’s Story of Stuff inspired my project. Overconsumption is a very real and often forgotten problem in our society today. This is a branded awareness campaign for overconsumption with 2D animation as the main component to the project. I created an animation of the everyday things we consume and to educate people of the awareness of overconsumption. Along with with promotional social media short animations, an informational infographic brochure, a poster, and the mindless consumption icon. I think that we often forget that all these products and stuff that we consume were made from extracting materials and then we throw away these products without a thought. I wanted this project to be informative, easy for every viewer to understand, and be eye-catching to the audience. Consuming is not necessarily bad, it is the mindless and uncontrolled consumption, and the mindless throw away that is hurting our planet. Let’s change.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/broshure%2022_0.png?itok=QVWLKfoi, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/FINAL%20Final%20BIG%20POSTER_0.jpg?itok=8VQlcIx6","tags":"Social Media","project":"Overconsumption","name":"sara  syme","nid":"221","profile":""}},{"node":{"email":"sara.syme.design@gmail.com","instructor":"frederick","link":"http://symedesign.myportfolio.com","desc":"Annie Leonard’s Story of Stuff inspired my project. Overconsumption is a very real and often forgotten problem in our society today. This is a branded awareness campaign for overconsumption with 2D animation as the main component of the project. I created an animation of the everyday things we consume and to educate people on the awareness of overconsumption. Along with promotional social media short animations, an informational infographic brochure, a poster, and the mindless consumption icon. I think that we often forget that all these products and stuff that we consume were made from extracting materials and then we throw away these products without a thought. I wanted this project to be informative, easy for every viewer to understand, and be eye-catching to the audience. Consuming is not necessarily bad, it is the mindless and uncontrolled consumption, and the mindless throw away that is hurting our planet. Let’s change.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/FINAL%20Final%20BIG%20POSTER.jpg?itok=9cN90_yi, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/broshure%2022.png?itok=b1lsC0UX","tags":"Information Design","project":"Overconsumption","name":"sara syme","nid":"220","profile":""}},{"node":{"email":"mel_lou97@yahoo.ca","instructor":"isabel","link":"http://meloudesign.com","desc":"It's the year 2099, and climate change has affected societies worldwide in drastic ways. Due to a combination of abrupt temperature fluctuations, increased natural disasters and crop disease, vast swaths of agricultural land are no longer fertile. In some countries, the outcome is ruin. In North America, people must grow their own food at home in order to survive. The Canadian government has a monopoly on the seeds that can be legally purchased and grown, resulting in limited selection and by extension, genetic diversity. While there are many who abide by the law, the black market holds a special allure for even the most upstanding citizens. How far would you go for something as basic as rice? \r\n\r\nSeedless is a speculative exploration that touches on a wide range of topics, from food systems, to government control, to human behaviour. At the core, it is a project about acknowledging the things we take for granted, as circumstances can change in the blink of an eye.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_9925.JPG?itok=ebVQxOWz, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_9945.JPG?itok=eTO58Dze, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/seed%20ads-06%20copy.png?itok=I1vghs6_","tags":"Food, Speculative Design, Sustainability","project":"Seedless","name":"Melissa Lou","nid":"219","profile":""}},{"node":{"email":"d.yang.design@gmail.com","instructor":"isabel","link":"http://dyangdes.com/","desc":"Popular media is resonant, and when media fans interact with each other to engage in creative labour, a fandom forms. Fans are reactive and subversive creators who interpret and transform the source material. Through creating fanworks such as fanfiction, fanart, zines, music, and interactive works, fans show appreciation of published works and each other.  Fannishness has become an axis of identity.\r\n\r\nThe Fanstory Project shares portraits of fans to demonstrate fandom’s cultural value. Interviews were conducted with fans to document current fandom history, and their stories are presented through poster, publication, and interactive experience. This thesis looks at methods of creation and consumption; the structures of community; and the reasons behind the fannish identity. Drawing from established concepts such as Jenkins’ textual poaching and Sabotini’s gift economy theory, The Fanstory Project shares the experiences behind and value of transformational fan labour.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/coloursmock3.png?itok=IZTWaI6u, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_0195_E.jpg?itok=xhCAjF3a, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_0331_E.jpg?itok=ePZ1ij_P, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_0382_E.jpg?itok=EUQlwBxV","tags":"Book Design, Communication, Community, Entertainment, History, Identity, LGBTQ+, Motion Graphics, Pop Culture, Social Justice, Social Media, Storytelling, Video","project":"The Fanstory Project","name":"Daphne Yang","nid":"218","profile":""}},{"node":{"email":"riley.mcclimond@gmail.com","instructor":"aliPatricio","link":"http://rileymcclimond.squarespace.com","desc":"In Bad Taste is an exploration of vernacular tools and the authoring operations behind antiquated forms of default graphic systems. Produced here is a practice of using commercially ubiquitous tools and embracing their functional limitations– treating clunky stationary ephemera as legitimate instruments for production in pursuits of challenging conventional approaches to craft in design. From this process I have developed a collection of ‘workaday’ graphic artifacts, that dominantly focus on using a digital label maker that has supplied me with an index of readymade font families and pictograms from which I have used as design apparati. By using these tools, I have translated rudimentary graphic operations in an effort to validate and champion these under appreciated forms. ","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/SET%201.jpg?itok=SQMsGNj5","tags":"Pop Culture","project":"In Bad Taste","name":"Riley McClimond","nid":"217","profile":""}},{"node":{"email":"riley.mcclimond@gmail.com","instructor":"aliPatricio","link":"http://rileymcclimond.squarespace.com","desc":"In Bad Taste is an exploration of vernacular tools and the authoring operations behind antiquated forms of default graphic systems. Produced here is a practice of using commercially ubiquitous tools and embracing their functional limitations– treating clunky stationary ephemera as legitimate instruments for production in pursuits of challenging conventional approaches to craft in design. From this process I have developed a collection of ‘workaday’ graphic artifacts, that dominantly focus on using a digital label maker that has supplied me with an index of readymade font families and pictograms from which I have used as design apparati. By using these tools, I have translated rudimentary graphic operations in an effort to validate and champion these under appreciated forms. ","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/SET%201.jpg?itok=SQMsGNj5, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/set%204.jpg?itok=bPZafS-3, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/CAKE%20HANDS%202.jpg?itok=i60o32l4, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/z.jpg?itok=LquO_h59","tags":"Pop Culture","project":"In Bad Taste","name":"Riley McClimond","nid":"216","profile":""}},{"node":{"email":"ethanwald@gmail.com","instructor":"lewis","link":"http://ethanwald.com","desc":"Vessel is the company of the future selling computer implants to the masses. The ecosystem consists of a proprietary BCI (Brain Computer Interface), and Audio Implant and a Hand Implant – Vessel allows users and corporations to collect and use a maximum amount of data. This ecosystem handles payment, identity, incoming/outgoing audio and converts everything into usable data. By 'merging' with the ecosystems, users adopt the next step of mobile computing. Vessel Ecosystem has maximized data output to create the modern cyborg.\r\n\r\nVessel Ecosystem highlights the impacts bleeding-edge technologies could have on music and artistry. By replacing traditional artists with data and algorithms, Vessel pushes the streaming model to the extreme. Living with an audio implant allows for custom music specific to every individual, or crowdsourcing the data of local vessel users to create community-based music. Both of these new music types translate to personal music, retail music and concert music.\r\n\r\nThe modern cyborg brings into question the state of artistry, corporate music, privacy and ethical data usage.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/20190429_234429.jpg?itok=umsf9JZw","tags":"Artificial Intelligence, Branding, Editorial Design, Motion Graphics, Music, Speculative Design, Video","project":"Vessel Ecosystem","name":"Ethan Wald","nid":"215","profile":""}},{"node":{"email":"kevin1997wu@gmail.com","instructor":"sheila","link":"http://kevinsgallery.net","desc":"Tea is a beverage for reconciliation, storytelling, and more. Thus, it often becomes central to the interpretation of my memories. Through tea, I am also able to better understand the memories I have for my hometown. I wish to memorialize my hometown in a manner that I could hold dear, and in a manner that is unique to my cultural conception. This project investigates the application of tea as a vehicle in the the memorialization of one’s home-town and lineage.\r\n\r\nAfter many years of being away from my hometown, which is the place where my father grew up and the place where my late grandfather had been, I realize that my memories of this hometown, including its ancient history and regal architectural impressions, are now slowly fading away from my mind. I wish to preserve these memories. However, after spending many years aborad, I cannot recall exactly what my hometown looks like now. Thus, in my engraved illustrations, I attempted to piece together photographs to reimagine the local architecture of my hometown, remaking the images that once seemed familiar to me. \r\n\r\nI also incorporated visually, within my work, the stories that my late grandfather had once told me. The stories about him feeding horses when he was young, stories of him serving in the military, and the stories of his time in public office... His stories were unforgettable. I observe these stories as not only my late grandfather’s memorable past in his hometown, but as an intergenerational enlightenment generously bestowed upon me. This inspiration became a crucial component in strengthening my work.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Kevin_Wu1.JPG?itok=FrAbAUYL","tags":"History, Identity, Storytelling, Tradition, Video","project":"The Memories of Tea","name":"Kevin Wu ","nid":"214","profile":""}},{"node":{"email":"julietdang15@gmail.com","instructor":"sheila","link":"https://www.julietdang.ca","desc":"To Be A Hero is a fantasy RPG developed with RPG Maker MV. It tells the story of five friends who travel across their land to uncover the truth and manipulation behind the war that raged between their homeland, Underra, and the neighbouring country, Koth. It's a story of embracing the differences in people, finding a sense of belonging, and extending kindness to others. ","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/image1.png?itok=zt76zCEQ, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/image2.png?itok=wiW1AKS-, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/image3_0.png?itok=ihWfma4J, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/image4_0.png?itok=YFrOV6_v","tags":"Entertainment, Game Design, Storytelling","project":"To Be A Hero","name":"Juliet Dang","nid":"213","profile":""}},{"node":{"email":"3151043@student.ocadu.ca","instructor":"sheila","link":"http://www.norasbakery.ca","desc":"Thesis Statement: \r\nHow the practice of cake-making contributes to a sense of community, belonging and celebration.  \r\n\r\nAbout the Business:            \r\nNora’s Bakery offers custom cake design workshops along with ready-made cakes.  \r\n\r\nCustom Cake Design Workshops: \r\nMy target market is children; ages 4-10 years old and their parents because children like to dream big and develop amazing ideas. This workshop takes place over the course of two days. The first day, I interview the child about the type of cake they would like to have for an upcoming occasion. I ask them about the shape, size, colour, flavour, decoration, and the ingredients needed. They design their own cake through drawing a sketch and constructing using crochet cake dummies and toppings including strawberries and piping. These make it easy for the child to visualize their cake in 3D. This opportunity allows children to have fun, be creative and appreciate handmade work. After the first session ends, I proceed to prepare the base of cake and frosting separately.\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  The second day of the workshop, the child develops hands-on skills by decorating their own cake using sup-plies provided. I closely assist the child through teaching and helping them achieve exactly what they’ve dreamed of. I have many years of experience working with children through workshops, camps, trips, babysitting and thus Nora’s Bakery can foster a safe and playful environment \r\nfor children. \r\n\r\nReady-made Cakes:\r\nNora’s Bakery also sells ready-made cakes for those who do not have time for the workshops or would prefer to pick up a cake on the go. Customers can come to my bakery and choose a cake or they can order a cake online and enjoy it for any occasion.\r\n\r\nAbout the Artist:\r\nI am currently in my 4th year at OCAD University studying Graphic Design. I completed a minor in Entrepreneurship and Social Innovation. When I was 10 years old, I took a crochet and baking class and really enjoyed both. Over the years, I took many other baking courses to gain more experience. Baking became my ultimate passionate and my goal is to combine both baking and graphic design to open my own bakery. \r\n\r\nMy Vision:\r\nI want children to be imaginative, develop many skills, and be satisfied with the cake they decorate. Nora’s Bakery is unique as it not only involves children but gives them a role and say in how their cake is decorated, which allows the child to feel important and heard. The crochet aspect is a great way to assist children with designing three dimensionally.\r\n    \r\nOverall, Nora’s Bakery is a great opportunity that brings my skills and passions together. Interviewing and working with children is a great way to gain inspiration and allows me to further expand my skill set and support a generation of bakers and dreamers.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Image%20from%20iOS%20%283%29.jpg?itok=1X4Aqila","tags":"Food","project":"Nora's Bakery","name":"Nora Bahgat","nid":"212","profile":""}},{"node":{"email":"3151043@student.ocadu.ca","instructor":"sheila","link":"http://www.norasbakery.ca","desc":"Thesis Statement: \r\nHow the practice of cake-making contributes to a sense of community, belonging and celebration.  \r\n\r\nAbout the Business:            \r\nNora’s Bakery offers custom cake design workshops along with ready-made cakes.  \r\n\r\nCustom Cake Design Workshops: \r\nMy target market is children; ages 4-10 years old and their parents because children like to dream big and develop amazing ideas. This workshop takes place over the course of two days. The first day, I interview the child about the type of cake they would like to have for an upcoming occasion. I ask them about the shape, size, colour, flavour, decoration, and the ingredients needed. They design their own cake through drawing a sketch and constructing using crochet cake dummies and toppings including strawberries and piping. These make it easy for the child to visualize their cake in 3D. This opportunity allows children to have fun, be creative and appreciate handmade work. After the first session ends, I proceed to prepare the base of cake and frosting separately.\r\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  The second day of the workshop, the child develops hands-on skills by decorating their own cake using sup-plies provided. I closely assist the child through teaching and helping them achieve exactly what they’ve dreamed of. I have many years of experience working with children through workshops, camps, trips, babysitting and thus Nora’s Bakery can foster a safe and playful environment \r\nfor children. \r\n\r\nReady-made Cakes:\r\nNora’s Bakery also sells ready-made cakes for those who do not have time for the workshops or would prefer to pick up a cake on the go. Customers can come to my bakery and choose a cake or they can order a cake online and enjoy it for any occasion.\r\n\r\nAbout the Artist:\r\nI am currently in my 4th year at OCAD University studying Graphic Design. I completed a minor in Entrepreneurship and Social Innovation. When I was 10 years old, I took a crochet and baking class and really enjoyed both. Over the years, I took many other baking courses to gain more experience. Baking became my ultimate passionate and my goal is to combine both baking and graphic design to open my own bakery. \r\n\r\nMy Vision:\r\nI want children to be imaginative, develop many skills, and be satisfied with the cake they decorate. Nora’s Bakery is unique as it not only involves children but gives them a role and say in how their cake is decorated, which allows the child to feel important and heard. The crochet aspect is a great way to assist children with designing three dimensionally.\r\n    \r\nOverall, Nora’s Bakery is a great opportunity that brings my skills and passions together. Interviewing and working with children is a great way to gain inspiration and allows me to further expand my skill set and support a generation of bakers and dreamers.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Image%20from%20iOS%20%283%29.jpg?itok=1X4Aqila","tags":"Food","project":"Nora's Bakery","name":"Nora Bahgat","nid":"211","profile":""}},{"node":{"email":"3150294@student.ocadu.ca","instructor":"isabel","link":"http://danieldhillon.format.com","desc":"My main yearlong project focuses on the subject of language, primarily investigating how second-generation Canadians feel about their parents’ native tongue. With Canada being such a diverse and multicultural place, I was curious to discover if the relationship I have with my parents’ native tongue is similar to others. If so, in what way, are we similar or different?\r\n\r\nMy intention was to analyze the language of second-generation Canadians from all different backgrounds taking a look at areas of; upbringing, knowledge, overcomings, advantages, disadvantages, and understanding of their parents’ native tongue to uncover a commonality amongst second-generation Canadians. The insight and discoveries from the project will hopefully bring awareness around a subject that is not commonly talked about amongst second-generation Canadians to help form a better understanding and community around this topic.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Octo-2.jpg?itok=QzdQ8Vpc, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_3580.jpg?itok=luItsH8q, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Screen%20Shot%202019-04-16%20at%2012.25.28%20PM.png?itok=P_qzAa1W, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Screen%20Shot%202018-12-13%20at%2010.02.32%20PM.png?itok=TxDicP6t","tags":"Language","project":"Hybrid Language ","name":"Daniel Dhillon","nid":"210","profile":""}},{"node":{"email":"kendra.j.jones@hotmail.com","instructor":"isabel","link":"http://kendrajones.format.com","desc":"Endangrrr is an educational multidisciplinary project that encourages children to be compassionate towards endangered animals in Ontario. The animals that were chosen to start the Endangrrr series are often misunderstood for being scary or unapproachable. The species are: Queensnakes, Lake Sturgeon, and bats (including the Little Brown Myotis, the Northern myotis, the Eastern Small-footed Bat, and the Tri-colored Bat). \r\n\r\nEndangrrr products are meant to educate children ages 8-11 of the harsh realities that endangered animals face so that they can share their knowledge and therefore create changes to protect these animals. The project encompasses outputs that are tangible and playful with materials that were sourced with care. It is both ethically and ecologically mindful wherever possible in order to maintain the values the project speaks to.\r\n\r\nIn order to advocate for the animals listed above, Endangrrr has created guide kits; they each contain a poster, a guide book, and a stuffed animal. ","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/KendraJones_gdex.jpg?itok=rnOLZAOS","tags":"Activism, Education, Environment","project":"Endangrrr","name":"Kendra Jones","nid":"209","profile":""}},{"node":{"email":"","instructor":"aliPatricio","link":"","desc":"Pathways is an exploration of existentialism through linear storytelling. In a world arguably devoid of any true purpose or plans for us, it's up to us to discover our own way. The way you live your life, no matter how it may be, is how you make it meaningful. Life is a journey and not just a physical one, but an emotional one. And we never stop growing. It's full of changes and we're included. Every decision we make, and every experience we have has shapes us into who we are today. And when reflecting on those experiences, and how we feel about them, we get the opportunity to decide for ourselves how we allow them to impact us. \r\n\r\nUsing a deck of cards to set a series of conditions, participants will then be asked a question relating to their life and experiences. They will then be encouraged to add their story to the collection by drawing their response in the form of a line. The lines serve as an interesting form of visual storytelling and offers a different way of reflecting upon personal experiences by allowing participants the freedom to decide for themselves where their own path will lead them.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_3686%20copy_1.jpg?itok=0A7E24H3","tags":"Storytelling","project":"Pathways","name":"Sarah Braithwaite","nid":"208","profile":""}},{"node":{"email":"","instructor":"aliPatricio","link":"","desc":"Pathways is an exploration of existentialism through linear storytelling. In a world arguably devoid of any true purpose or plans for us, it's up to us to discover our own way. The way you live your life, no matter how it may be, is how you make it meaningful. Life is a journey and not just a physical one, but an emotional one. And we never stop growing. It's full of changes and we're included. Every decision we make, and every experience we have has shapes us into who we are today. And when reflecting on those experiences, and how we feel about them, we get the opportunity to decide for ourselves how we allow them to impact us. \r\n\r\nUsing a deck of cards to set a series of conditions, participants will then be asked a question relating to their life and experiences. They will then be encouraged to add their story to the collection by drawing their response in the form of a line. The lines serve as an interesting form of visual storytelling and offers a different way of reflecting upon personal experiences by allowing participants the freedom to decide for themselves where their own path will lead them.\r\n","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_3686%20copy_0.jpg?itok=HN5LmnlM","tags":"Storytelling","project":"Pathways","name":"Sarah Braithwaite","nid":"207","profile":""}},{"node":{"email":"","instructor":"aliPatricio","link":"","desc":"Pathways is an exploration of existentialism through linear storytelling. In a world arguably devoid of any true purpose or plans for us, it's up to us to discover our own way. The way you live your life, no matter how it may be, is how you make it meaningful. Life is a journey and not just a physical one, but an emotional one. And we never stop growing. It's full of changes and we're included. Every decision we make, and every experience we have has shapes us into who we are today. And when reflecting on those experiences, and how we feel about them, we get the opportunity to decide for ourselves how we allow them to impact us. \r\n\r\nUsing a deck of cards to set a series of conditions, participants will then be asked a question relating to their life and experiences. They will then be encouraged to add their story to the collection by drawing their response in the form of a line. The lines serve as an interesting form of visual storytelling and offers a different way of reflecting upon personal experiences by allowing participants the freedom to decide for themselves where their own path will lead them.\r\n","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_3686%20copy.jpg?itok=PoMwPw8d","tags":"Storytelling","project":"Pathways","name":"Sarah Braithwaite","nid":"206","profile":""}},{"node":{"email":"joyceong143@gmail.com","instructor":"debbie","link":"https://joyceongdesign.com/","desc":"A young adult's perspective and journey on gaming addiction.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Game%20Logo_1.png?itok=iaMojUy3, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Annotation%202019-04-25%20235524_0.png?itok=fH5OjDZk, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Annotation%202019-04-25%20235757_0.png?itok=2vHdx6qo","tags":"Game Design","project":"AFK","name":"Joyce Ong","nid":"205","profile":""}},{"node":{"email":"morganroy94@gmail.com","instructor":"sheila","link":"http://www.morganroy.ca","desc":"Women on the Line is a work that addresses the issue of gender-based harassment on public transit.  These pieces engage critically with the forms of harassment that women and femmes* face and allows viewers to situate themselves within this social issue. Survivors’ stories submitted anonymously populate an archive that lives online for anyone to access and contribute to. Womenontheline.com’s digital collection of stories aims to illustrate the complexity of this social issue, as well as overarching themes of discrimination, victimization and community passivity. The installation portion of this work is intended to represent survivors’ experiences and how these subtle forms of harassment are ignored, or even tolerated within our society.  From a distance the subway tiles which line the exhibition space appear to be purely decorative, but when viewed up close reveal to be engraved with survivors’ stories. The motivation behind Women on the Line was to give women and femmes capacity to name our experience and see ourselves as agents of change, while creating community accountability for a problem that our society too often ignores.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/RoyMorgan_WOTL.jpg?itok=7l2dnm_-, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/RoyMorgan_WOTL2.jpg?itok=mz6t_SWb, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/RoyMorgan_WOTL4.jpg?itok=RZpmf6d3","tags":"Activism","project":"Women On The Line","name":"Morgan Roy","nid":"204","profile":""}},{"node":{"email":"mikahlaiuele@hotmail.com","instructor":"saskia","link":"http://mikahla.ca","desc":"","images":"","tags":"Activism","project":"Cuntroversy","name":"Mikahla Iuele","nid":"203","profile":""}},{"node":{"email":"3149795@student.ocadu.ca","instructor":"isabel","link":"http://devdixitdesign.com","desc":"\tThe campaign TO Green was designed to communicate to individuals living in Toronto about how to reduce their ecological footprint in engaging manners. By focusing to provide the information to children to young adults this allows the information to be provided through various means like a narrative short film, comic, catalogues, postcards and a website. Allowing users to choose what manner they would like to get their information from. Either it being through and entertaining narrative or formal documentation. \r\n\r\nThis is done in an effort so that the people of the city of Toronto can collectively reduce the amount of unnecessary thing we consume and waste. TO Green was created to provide the “right” information that person need to change their habits and behavior in a simple yet effective manner to reduce your eco footprint. As we at TO Green have already done the work of finding out how to reduce your eco footprint. Now it is up to you to change your behavior to reduce your ecological footprint and help save the world.\r\n","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/TO%20Green.jpg?itok=9pcGkJE9, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Screen%20Shot%202019-04-15%20at%2011.42.50%20PM%20copy.png?itok=-xdnfTyJ, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/comic%20final_0019_1%20copy.jpg?itok=kfTUOHVj","tags":"Environment","project":"TO GREEN","name":"Dev Dixit","nid":"202","profile":""}},{"node":{"email":"naddydebrah@gmail.com","instructor":"sheila","link":"http://www.nanadebrah.com","desc":"The Deep Roots gun violence prevention toolkit is a guide for creating positive change in Toronto’s marginalized communities through the use of youth-led community action projects. \r\nToronto’s violence issue is one that shamefully seem to only get proper attention when the shootings move from marginalized neighborhoods to relatively white and affluent ones. The Toolkit promotes the engagement of racialized youth in identifying challenges and solutions from a holistic perspective. It also explores and highlights the importance of action projects. By doing a project, youth put into practice leadership and life skills such as critical thinking, empathy, and effective communication. It offers helpful insights into how the youth can have an impact on the way their communities are shaped and built. It is filled with activities aimed at engaging young people to explore the social factors in their communities. The big idea is to create opportunities to bring youth ideas and concerns directly to the decision makers, policy leaders and key people in the community who have the capacity to act on these recommendations.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/homepage.png?itok=g3G_hKej, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/about%20page.png?itok=Uoe9O7BG, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/phase%20intro.png?itok=TelOZvS4, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/activities%202.png?itok=rH034fzh","tags":"Activism, Book Design, Race, Web Design","project":"Deep Roots Gun Violence prevention toolkit for youth","name":"Nana Debrah","nid":"201","profile":""}},{"node":{"email":"julietdang15@gmail.com","instructor":"sheila","link":"https://www.julietdang.ca/","desc":"To Be A Hero is a turn-based RPG developed in RPG Maker MV and is about embracing differences in others, finding a sense of belonging, and extending kindness to others. The characters come from different walks of life and have different skills that make them unique - but it's those differences that can make you grow as a person and learn things you've never thought about. This project is a labor of love to my growth as a person and creative individual and also serves as a homage to the video games that have given me strength and courage despite my insecurities.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/title%20screen.png?itok=O3Q_HwPU, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/image4.png?itok=StnkEMEE, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/image3.png?itok=kkJFD2Cu, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/image5.png?itok=1WEPuJEj","tags":"Storytelling","project":"To Be A Hero","name":"Juliet Dang","nid":"200","profile":""}},{"node":{"email":"willowmgsharp@gmail.com","instructor":"karin","link":"http://willowsharp.ca","desc":"The average North American produces around 70 pounds of textile waste a year. The aim of this project is to confront this abstract number through its physical manifestation and manipulation of one year’s worth of textile waste. The quilted format references a tangible connection to Canadian material heritage and a metaphoric representation of what we are passing down to the next generation.This data object is both a chance to reckon with our own behaviour and a meditation on how large one individual’s impact truly is. \r\n\r\nMore than 30 people contributed to the making of this project through sewing workshops. The contemplative act of sewing invited participants to think about their relationship to their clothes and to begin a broader conversation about sustainability. Our effect on the environment is a heavy burden that we must confront and carry; radical change will not come easily. The patience we will need is reflected in the months of labour of intensive sewing it took to put this together. Thinking differently about the part we play starts with a change in mind set. We all need to change if we are going to have an environment worth passing down to future generations.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Sharp_Willow_DocumentationMain.jpg?itok=i7ESxW5M, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_0042%20editted%20cmyk%20copy.jpg?itok=F8gnACdN","tags":"Environment","project":"70 lbs","name":"Willow Sharp","nid":"199","profile":""}},{"node":{"email":"jodiew.leung@gmail.com","instructor":"karin","link":"http://www.jodieleung.com","desc":"Aether is an experiential pop-up shop aiming to expose the wellness industry’s predatory practices through satire. \r\n\r\nA line of seven absurd products embody the industry’s practices of exploiting our naivety and feelings of inadequacy for profit. The fabrication of illness and unsubstantiated claims within the areas of mindfulness, fitness, energy, and beauty are captured in this suite of objects that are more extreme caricatures of products for sale today. Upon engaging with the smart mirror, viewers will receive a personalized wellness diagnosis outlining problems with their well-being. Each diagnosis has a matching product from the suite of objects acting as a treatment to their illness – identified by a corresponding gradient.\r\n","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Leung_Jodie_DocumentationMain.jpg?itok=VJNK7bPM","tags":"Consumerism, Packaging, Well-being","project":"æther","name":"Jodie Leung","nid":"198","profile":""}},{"node":{"email":"abchadwick75@gmail.com","instructor":"aliPatricio","link":"https://antoinebchadwick.format.com/","desc":"My project explores the life cycle of our smartphones (from the mining of minerals to the discarding of our devices) and its consequence on the environment and people. Through video I attempt to show a bigger picture that visually depicts all the elements and phases of a phone's life.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Screen%20Shot%202019-04-26%20at%201.56.08%20AM.png?itok=XyE0-k2M","tags":"Communication, Motion Graphics, Sustainability, Video","project":"The life cycle of smartphones: A visual ecosystem","name":"Antoine Chadwick","nid":"197","profile":""}},{"node":{"email":"lucy.jy.son@gmail.com","instructor":"debbie","link":"http://lucyson.wordpress.com","desc":"International students can wilt from too much responsibility for carrying the family name into the world of college and of work in a foreign country because their parents have counted on them without understanding about the lives in a new country. The lack of understanding and conversation is the main reason why international students feel pressure and added responsibilities. YOU are WELCOME is a social community that provides an empathetic social space to share one's situations and thoughts with other users and their parents as well. This app provides the chance to understand and get a piece of information to both international students and their parents to reach out to live in a foreign country. The brand name “YOU are WELCOME” has two different meanings. This social community provides helpful space to people who need help, understand and empathy. So this app says “You are welcome!” to people who get helps from it. The second meaning is to greet a new member joining this social community because greeting can emphasize a sense of belongingness for international students. There are three levels in this app. Welcome Level is an entry level that people can automatically get when they join in. The users can get a Friend Level and a Supporter Level when they succeed to achieve a specific term. When a new user joins in, they can get a guide book. This guide book will provide five different information which are emergency, non-emergency call numbers and helpful URL, tips for international tenants, cold weather in Toronto, gratuity tip, and important TTC destination. When users achieve a term for being a supporter level, they will get a YOU are WELCOME package that has a certification for being a supporter level, a quotation book of themselves, and YOU are WELCOME pin badges.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/lucy_Page_05.jpg?itok=q7SSreYh, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/lucy_Page_08.jpg?itok=frZEDJih, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/lucy_Page_10.jpg?itok=0_-5mmuY, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/lucy_Page_12.jpg?itok=G02_U3A2","tags":"Branding, Community, Mental Health, Web Design","project":"YOU are WELCOME","name":"Lucy Jiyeon Son","nid":"196","profile":""}},{"node":{"email":"3150511@student.ocadu.ca","instructor":"debbie","link":"https://joyceongdesign.com/","desc":"How does a young adult who refuses to acknowledge they have a gaming addiction see the world?","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Game%20Logo_0.png?itok=mSWDiMAl, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Annotation%202019-04-25%20235524.png?itok=l9nZZiU4, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Annotation%202019-04-25%20235757.png?itok=LmtPzCjE","tags":"Game Design","project":"AFK","name":"Joyce Ong","nid":"195","profile":""}},{"node":{"email":"3150511@student.ocadu.ca","instructor":"debbie","link":"https://joyceongdesign.com/","desc":"How does a young adult who refuses to acknowledge they have gaming addiction see the world around them?","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Game%20Logo.png?itok=BS8E005H","tags":"Game Design","project":"AFK","name":"Joyce Ong","nid":"194","profile":""}},{"node":{"email":"seonhealee@gmail.com","instructor":"frederick","link":"http://seonhealee.format.com","desc":"UNIC stands for Unique Colors, which means each color is unique to each person because the reaction to each color is different in each eye.\r\n\r\nUNIC is a Color Blind Test application that provides three distinguishing features: Color Vision Test, Seeing Colors Around You, and Color Distortion. Color Vision Test is a self-assessment tool to find out type and extent of color vision deficiency that consists of triangular patterns, with different colors forming a number or a letter in the center of a circle. Seeing Colors Around You offers to distinguish colors around you if you are color blind. It tells you the name of the colors you want to know with exact RGB color codes. Color Distortion is an experience tool, which simulates to get a sense of how color blind people see the world by providing filtered photographs. ","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Lee_UNIC_0.jpg?itok=VlRRRD5J","tags":"Branding, Information Design","project":"","name":"Seon Hea Lee","nid":"193","profile":""}},{"node":{"email":"seonhealee@gmail.com","instructor":"frederick","link":"http://seonhealee.format.com","desc":"UNIC stands for Unique Colors, which means each color is unique to each person because the reaction to each color is different in each eye.\r\n\r\nUNIC is a Color Blind Test application that provides three distinguishing features: Color Vision Test, Seeing Colors Around You, and Color Distortion. Color Vision Test is a self-assessment tool to find out type and extent of color vision deficiency that consists of triangular patterns, with different colors forming a number or a letter in the center of a circle. Seeing Colors Around You offers to distinguish colors around you if you are color blind. It tells you the name of the colors you want to know with exact RGB color codes. Color Distortion is an experience tool, which simulates to get a sense of how color blind people see the world by providing filtered photographs. ","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Lee_UNIC.jpg?itok=ynmqbB_j","tags":"Branding, Information Design","project":"UNIC","name":"Seon Hea Lee","nid":"192","profile":""}},{"node":{"email":"jaimehilditch1@me.com","instructor":"isabel","link":"","desc":"“The Earth Needs a Break…From Plastic” is the first in a series of books that I am creating. This edition includes: a short introductory animation, a lively and informative story book, and Earth Week activity sheets. The worksheets are to be completed throughout Earth Week, which begins each April 22nd. I used paper cut-outs and collected plastics to form the book’s illustrations. The collection and cutting were both slow and mindful activities. The products I used, were environmentally friendly, and included: vintage paper, scraps, and cut-offs. ","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/P1050542.JPG?itok=2Tx5bjF9, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/P1050539.JPG?itok=Dhas7uNU, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/P1050521.jpg?itok=cZJBq-GD, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/P1050533.JPG?itok=riWlqEes","tags":"Environment","project":"The Earth Needs a Break...","name":"Jaime Hilditch","nid":"191","profile":""}},{"node":{"email":"jr14lj@student.ocadu.ca","instructor":"isabel","link":"","desc":"Forced Displacement in Colombia is an exploration of Latin America's worst and longest socio-political armed conflict and its impact in the internal displacement of people. The topic is presented in three outputs: a timeline describing major events from 1948–2018; a newspaper highlighting stories and tragedies faced by millions of displaced Colombians; and a short documentary about events in Sierra Nevada de Santa Marta.\r\n","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_0083.jpg?itok=giaoAZG7, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_0080.jpg?itok=QTJCbGLX, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_0222.jpg?itok=MQqrZOo8, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Julian%27s_Documentary.jpg?itok=5jFKEOw-","tags":"Collective Memory","project":"Forced Displacement in Colombia","name":"Julian Restrepo","nid":"190","profile":""}},{"node":{"email":"","instructor":"karin","link":"http://donyaref.com","desc":"The practice of graphic design is, at its core, an act of communication; of transmitting ideas and shaping our view of the world. As such, it is inextricably tied to institutions of power and the dominant ideologies of a time and place.\r\nThis project aims to draw attention to the often imperceptible ways in which Western narratives of the Middle East, and more specifically Iran, are influenced by a long history of imperialism. Through various graphic design lenses, this subject is investigated. The website closely examines one specific historical event: the 1953 U.S. led coup against a democratically elected government in Iran. The print piece is a creative reflection on the importance of critical thinking when consuming cultural materials which make up the products of communication design practices. Finally, the video draws attention to how we, as individuals, can both absorb and reflect dominant ideologies propagated by the ruling classes. The overarching intention is to encourage a more critical engagement with information by highlighting the ways in which history and the media can be manipulated to serve those in power.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Screen%20Shot%202019-04-15%20at%204.35.43%20PM.png?itok=3DFdPFWC, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/DSC_0491.jpg?itok=OsDR6fjI, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/DSC_0586.jpg?itok=F747-I5U, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Screen%20Shot%202019-04-21%20at%204.00.57%20PM.png?itok=52Vw3Tj9","tags":"Communication, Decolonization, History, Politics","project":"Crude Means","name":"Donya Aref","nid":"189","profile":""}},{"node":{"email":"","instructor":"frederick","link":"http://www.amckenzie.ca","desc":"omit is an attempt to make people aware of the climate change issues people are facing right now. It isn't a what if, it is a wake up call for people who are un aware of what people are going through. ","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Poster%20MockUp%20Vert%20and%20Horiz.jpg?itok=7h7D1Oq1, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Paperback-Book-Mockup-vol-2.jpg?itok=mmPE3GJq","tags":"Environment","project":"omit","name":"Alex McKenzie","nid":"188","profile":""}},{"node":{"email":"","instructor":"saskia","link":"http://www.amykim.ca","desc":"(Project tags - branding, packaging, well-being)\r\n(Format - branding, packaging, print)\r\n\r\n\r\nWomen dealing with skin sensitivities have a hard time finding safe products. This issue is due to the lack of transparency from companies that market false claims such as “dermatologist recommended” and/or “hypoallergenic”, when the products actually contain harmful ingredients. (Xu, 2017).\r\n\r\nIn response to this misleading representation in the cosmetic industry, Safe Spot strives to support women with skin sensitivities. Our product line includes makeup, skincare and undergarments—products that are in constant contact with our skin. Our mission is to 1) build a community of open-minded women, 2) create a positive shopping experience and 3) help cultivate self-love and confidence. \r\n\r\n1) Safe Spot is an environment that provides community for the open-minded. With meet-ups organized both in store and online, discussion topics range beyond skin condition, including ethnicity and size.\r\n2) Safe Spot is a community that encourages women to confront their skin image issues, helping to cultivate self-love and confidence from within. Our support includes positive messages communicated through lettering and illustrations with uplifting narratives.\r\n3) Safe Spot is all about transparency. Every ingredient is clearly listed where visible, and our products do not contain fragrances or preservatives that aggravate skin. Our packaging too, is free from toxic chemicals. With Safe Spot, we hope to give relief to women who no longer want stressful shopping experiences. Now feel free to have fun!\r\n\r\nXu, S. (2017, November 01). Performance Characteristics of and Allergens in Best-selling Moisturizers. \r\nRetrieved from https://jamanetwork.com/journals/jamadermatology/article-abstract/2652353\r\n","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/SafeSpot_BrandBook_V2.jpg?itok=T7cwxiPO, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/SS_Lettering_V3-01.jpg?itok=6vXVan_9, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/DSC08579.jpg?itok=2UNOdzLs, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/DSC08593.jpg?itok=hbI15ouY","tags":"Book Design","project":"Safe Spot","name":"Amy Kim","nid":"187","profile":""}},{"node":{"email":"matthewwylee@gmail.com","instructor":"lewis","link":"http://matthewwylee.com","desc":"Through the exploration of physical form, Matthew\r\nis investigating common threads between\r\ncraft, his family history, and capitalist\r\nsystems that disconnect us from inherently\r\nhuman activities. Through this exploration he\r\ndeal with themes of alienation from production\r\nand materiality. Craft, Labour, Love\r\nconsists of a plethora of imagery and\r\nsculptural form to help guide viewers along\r\na personal exploration. He uses his family\r\nhistory as a vessel to discuss the dense\r\ntopics of craft and labour in a relatable and\r\npersonal fashion. This semester he has been\r\ntying many styles of craft and design together \r\ninto a coherent narrative of craft and labour, \r\nbut also of family and cultural history.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/hk3.jpg?itok=elYFOqOJ, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/AMA-2.jpg?itok=91btO3Qw, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Violin-12.jpg?itok=Pp3RrK4U, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Hakka%20clothing%20.jpeg?itok=aSLRQOf2","tags":"Book Design, Diaspora, History, Race, Textile design, Tradition","project":"Craft, Labour, Love","name":"Matthew Wai Yiu\\ Lee","nid":"186","profile":""}},{"node":{"email":"hayes.christina@outlook.com","instructor":"isabel","link":"https://www.christinahdesign.com/","desc":"Personality assessments and models have been made readily accessible to the public in the form of online questionnaires, garnering popularity due to their quick and clear results. My undergraduate thesis is an exploration of the feedback loop generated from the self-report style of these online tests.\r\n\r\nThe website features two interactive components: an investigation of three widely popular online personality questionnaires, and a new assessment that repurposes the self-report format to promote reflection and critical thought. Upon receiving an assessment result, visitors are encouraged to take a corresponding bookmark or sticker as a means of remembering it. An additional informative video summarizes the overall nature of online personality tests and includes a commentary on how they rely upon self-input.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/img3.png?itok=rNgAtLQF, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/notatest2_1.png?itok=9pyR5o0h","tags":"Motion Graphics, Psychology, Web Design","project":"This is not a test.","name":"Christina Hayes","nid":"185","profile":""}},{"node":{"email":"hp88502225@gmail.com","instructor":"frederick","link":"http://h-design.org","desc":"","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/blue%20pocket%20poster.jpg?itok=ybpiEaYK","tags":"Branding","project":"Blue Pocket Clothing","name":"Jiangning Huang","nid":"184","profile":""}},{"node":{"email":"info@alicjapona.com","instructor":"karin","link":"http://www.alicjapona.com","desc":"Humans are spending an increasing amount of time indoors and in front of electronic devices while spending less time interacting with nature. This results in a lack of connection with the natural world, which has countless benefits to humans and their wellbeing.\r\n\r\nDear Nature includes an application prototype called “Happy Place,” and a letter writing station made to create opportunities for viewers to connect with nature. I want to inspire spending more time in nature through the means of reflection and inspiration. \r\n\r\nHappy Place was made to connect people living in cities to nature near them and to encourage frequent interactions with nature. The app allows users to share their favourite nature spots and to find and explore new spots close to their neighbourhood. \r\nThe letter writing station asks participants to write a letter to nature and pin it up for others to read and become inspired. This allows participants to take the time to reflect positively on their own relationship with nature.\r\n","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Pona_Alicja_DocumentationMain.jpg?itok=-yH6zFvB","tags":"Entertainment","project":"Dear Nature","name":"Alicja Pona","nid":"183","profile":""}},{"node":{"email":"sali.hejji@gmail.com","instructor":"isabel","link":"http://sali-hejji.com","desc":"Frame is an awareness campaign targeted towards teenage girls to educate and inform them about the procedures and risks of cosmetic surgery and cosmetic injections. The regular exposure to cosmetic surgery is normalizing procedures and creating a desire to undergo change among teenage girls in order to achieve a look people believe will make them happy. Interest in procedures are rising, many girls already have a particular idea about how they want to look. \r\n\r\nMany problems are arising for our younger generation as they are being brought up in a world with unrealistic beauty standards. In this campaign, we create an experience for the viewer to get in and understand the issue in more detail by portraying real life experiences of women that went “under the knife or needle” as we look at how and why these women decide to go for the procedures and how it affected them physically and mentally. There will also be a chance for the viewers to participate and experience things by themselves. ","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/2.jpg?itok=uJUewM-z, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/3_0.jpg?itok=r96iYWxP, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/4.jpeg?itok=wPp39Rb6, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Screen%20Shot%202019-04-22%20at%208.22.52%20PM.png?itok=7bU1NbTH","tags":"Pop Culture","project":"FRAME","name":"sali hejji","nid":"182","profile":""}},{"node":{"email":"ss13gl@student.ocadu.ca","instructor":"michael","link":"http://www.staceysextondesign.com","desc":"With the aid of visual language and sonic composition, can one find meaning in rhythm, solace in melody and ultimately overcome extreme emotional conditions? \r\n\r\nThe grieving process is a long, arduous journey, one that many will have to endure at some point in their life, yet it is often a topic that is avoided. This process can be comprised of upwards of 10 stages before reaching acceptance. In 2013, I was faced with this process when my father passed away after a battle with illness. Throughout, music has played an integral part to my grieving process, whether it was listening, playing or creating music – immersing myself in this type of mental space has been helpful & therapeutic. Using music as therapy is not a new idea, within this project I wanted to explore this idea further using design, my own sonic creations & technology that can help aide us to surrender ourselves for a moment in time, yet recognize our willingness to proceed. \r\n\r\nThe user can view, manipulate & interact with each stage of grief: anger, shock, withdrawal, depression, acceptance & growth, through motion, interaction & creation of music. This medium acts as a tool to inform but to also be informed, creating a space for the grievances to be acknowledged yet giving the user tools to create something new in the process.\r\n\r\n\r\n","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/stacey%20sexton%20grievances%204.png?itok=TuxpASoI, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/stacey%20sexton%20grievances%207.png?itok=QDQ2FjGy, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Grievances%201.png?itok=9OYK9imP, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Stacey%20Sexton%20Grievances%202.png?itok=olR4XdzX","tags":"Music","project":"Grievances","name":"Stacey Sexton","nid":"181","profile":""}},{"node":{"email":"lukeheesunjung@gmail.com","instructor":"saskia","link":"https://www.instagram.com/jung.heesun","desc":"During our lives, we are constantly encountering ourselves through others. We may feel superior to those lower on the social pyramid, by the same token we feel marginalized when we interact with privileged others. Social media allows individuals to visualize a perfect life. Between this visual flow of capitalistic society and our natural identity, I ask the question: “How do we make a choice between A and B”","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Encounters_poster_h.jpg?itok=9efESMUu","tags":"Communication","project":"Encounters","name":"Heesun Jung","nid":"180","profile":""}},{"node":{"email":"jessicanunezz@hotmail.com","instructor":"karin","link":"http://www.jessnunez.com","desc":"Within Western culture, senior citizens are too often marginalized and lacking in the respect they deserve. This project encourages interaction between generations through the tradition of letter writing, and is based on a strong belief that there is much to learn from those who have a lifetime of knowledge.\r\n\r\nA starter pen pal kit is presented, which includes various letter writing tools and activities to support connection and sharing. The intention of the project is to give people across generations an opportunity to correspond, with the hope of fostering friendship, storytelling, and teaching. \r\n","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/_DSC0485.jpg?itok=eNVEe7UF","tags":"Tradition","project":"Letters Between Generations","name":"Jessica Nunez","nid":"179","profile":""}},{"node":{"email":"714482237kitty@gmail.com","instructor":"frederick","link":"https://littledinosaur.format.com","desc":"My goal is to explore child psychology and making a series product for kids. Parents want their kids to grow up healthy and happy. However, most of the kids will have some issues such as dealing with procrastination, unstable mood and losing temper; so the parents might want to buy some stuff in order to make children happy or to improve children's confidence, intelligence quotient, and emotional intelligence.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/50436E1C99537ED770DFAFB9359C3286.jpg?itok=BA47Hi5v","tags":"Branding","project":"Little Dinosaur","name":"Kitty Li","nid":"178","profile":""}},{"node":{"email":"dominika.grzesik@outlook.com","instructor":"saskia","link":"https://grzesik-dominika.format.com/","desc":"Patterns surround us. They are the ancient language of the universe and the beat to which we dance. While some are tangible, like the elliptical grooves on our fingertips, others are ethereal repetitions in time. Just like the harmonious orbits of celestial bodies as they float through space, many of the routines, systems, and materials that we design for ourselves are synchronized with the rhythms of nature. We go to sleep when the sun sets, we engineer through processes like biomimicry—we even navigate through urban tunnels like beetles burrowing through the hollows of trees. \r\n\r\nIn such a tumultuous time of environmental catastrophe and political unrest, we are in dire need of an empathetic shift towards human and non-human beings alike. Perhaps by recognizing our relationship to nature’s intuitive systems of organization we may be able to solve many structural issues within our society today. Form Follows Nature aims to express the silent language of patterns through the cinematic experience, where form, movement, and sound are intertwined in a symbiosis of time and space. As different patterns emerge and fluctuate against the black void of the screen, we begin to see the universe as a fertile incubator of change and growth to which we are nothing more and nothing less than a soft footprint through cosmic transformation. \r\n\r\nNarrated by the powerful, feminine voice of Sylvia Plath, her poem Mushrooms gives a voice to those inherently voiceless beings. As the organisms grow and multiply softly and quietly, we begin to realize that not all revolutions are loud ones.\r\n\r\nBy bringing a sensory awareness to the beautiful metaphors that exist between nature, humans and artifice, we can begin to propose an openness towards alternative ways of thinking about the human condition. Through this constant reframing of perspectives­—like the flux, clash, and flow of patterns, we may begin to optimistically direct our gaze away from objective frameworks of knowledge and towards a critical, inclusive, and biocentric future.   ","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Emerging%20patterns%20alphabet.jpg?itok=4Cf875nX, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Screenshot%202019-04-20%2001.10.51.png?itok=BYNJ3xxq, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Screenshot%202019-04-20%2001.13.38.png?itok=S-HxNPe2, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Screenshot%202019-04-20%2001.21.18.png?itok=UK-Khtne","tags":"Motion Graphics","project":"Form Follows Nature","name":"Dominika Grzesik","nid":"177","profile":""}},{"node":{"email":"caro.uscategui.moncaleano@gmail.com","instructor":"lewis","link":"https://uscategui-carolina.format.com/","desc":"How do we mourn those we do not know? \r\n\r\nHow do we mourn those we do not know, in a space that is responsible for their deaths? \r\n\r\nHow do we conjure the voices of the Dead? \r\n\r\nThe five steps of grieving have been used to help people in North America process the death of a loved one, it first begins with denial and ends with acceptance. The Ritual of Oro uses the steps of grieving as a tool to communicate the Dead’s reality. In this ritual you do not mourn one person but rather the deaths of a whole, deaths of the past, present and future. These individuals are not loved ones but rather complete strangers.  Every day at least one social leader, land defender, peasant, and indigenous person is murdered in Colombia, they are murdered for protecting truth, life, land, and freedom. These homicides have become the violent consequences of conflict between colonial powers pushing for an ideal of ‘development’. Canada is one of these colonial powers that pushes development onto Colombian land, Toronto specifically gains a great sum of its wealth from mineral exploitation, and one of the countries it gains its wealth from is Colombia. \r\n\r\nThe ritual space has been purposefully organized as a museum space, the relics are on display and placed in clear cases. The relics cannot be touched only seen, this positioning comments on the land the relics are placed within, a land that won’t acknowledge the Dead, and won’t respect the living. The Dead cannot trust the touch of those who live in Toronto due to that same touch being the reasoning of their deaths. \r\n","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/mask%20_0.jpg?itok=w3M_ZTPf","tags":"Storytelling","project":"The Ritual of Oro ","name":"Carolina Uscategui","nid":"176","profile":""}},{"node":{"email":"yoob96@gmail.com","instructor":"michael","link":"http://allbyyoob.com","desc":"Sweet Dreams is 360° interactive VR experience exploring the state of lucid dreaming through\r\nwhimsical creations of dream settings. The project’s goal is to invite users to experience the state of\r\nlucid dreaming and to bring up a conversation about the potential ways to practice lucid dreaming\r\nwith VR. The idea was inspired by a research article written about the effects VR has while\r\ndreaming. Dr. Jayne Gackenbach discusses about the extensive use of VR could have a greater\r\nawareness in dreams and users may view the dream world as same lens as VR world. In the VR\r\nworld of Sweet Dreams, it reflects back to childhood memories and moments of celebration to evoke\r\nsense of joy and playfulness. Cake plays the major role in Sweet Dreams, evoking celebratory\r\nsetting as giving and receiving cake entices moments of pleasure and happiness. With the metaphor\r\nof cake and ability to control yourself in virtual reality, I hope the users will immerse to Sweet dreams\r\nwith pleasurable experience.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Screen%20Shot%202019-04-10%20at%2012.34.33%20AM_0.png?itok=-qoqSv7e","tags":"Virtual Reality","project":"Sweet Dreams","name":"Yubin Lee","nid":"175","profile":""}},{"node":{"email":"yoob96@gmail.com","instructor":"michael","link":"http://allbyyoob.com","desc":"Sweet Dreams is 360° interactive VR experience exploring the state of lucid dreaming through\r\nwhimsical creations of dream settings. The project’s goal is to invite users to experience the state of\r\nlucid dreaming and to bring up a conversation about the potential ways to practice lucid dreaming\r\nwith VR.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Screen%20Shot%202019-04-10%20at%2012.34.33%20AM.png?itok=791WfnDw","tags":"Virtual Reality","project":"Sweet Dreams","name":"Yubin Lee","nid":"174","profile":""}},{"node":{"email":"alessandracavv@gmail.com","instructor":"frederick","link":"http://designsbyaless.ca","desc":"Emerge is a set of hygiene and makeup products divided into three sub-brands targeting different audiences: male, females, and gender non-binary. Currently, there are not many brands in the market that target wider audiences and appeal to different genders. \r\n\r\nI am opening the doors to new consumers––most recently males who have been coined \"beauty boys\"––by creating packaging that will make males confident and comfortable with buying a socially constructed female product. Of course, there will be people who are fine with buying beauty products marketed for other genders. \r\n\r\nHowever, I am exploring the need for design to be gender-specific so that everyone feels included. My product will also target gender non-binary people by using packaging that is nonconforming to the widely held gender ideologies we see today. In this way, inclusivity will prosper and voices will be heard. ","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/CavaliereA_OcadWebsite.jpg?itok=uRse5c3R, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/CavaliereA_OcadWebsite2.jpg?itok=9QIpLPD1, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/CavaliereA_OcadWebsite3.jpg?itok=8KVUetnD","tags":"Branding, Gender, Packaging","project":"Gender Specific Branding ","name":"Alessandra Cavaliere","nid":"173","profile":""}},{"node":{"email":"algmckeown@gmail.com","instructor":"saskia","link":"http://www.ashlee.design","desc":"Allegory unifies my lifelong fascination with and passion for fanciful creature design with my own formal art and design practice. The unconventional triptych merges the experimental nature of illustrated speculative fiction with the formal processes of design thinking. Allegory aims to synthesize art with design and reverie with tactility.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/full-triptych.png?itok=_x8qvyeT","tags":"Speculative Design","project":"Allegory","name":"Ashlee McKeown","nid":"172","profile":""}},{"node":{"email":"mikahlaiuele@hotmail.com","instructor":"saskia","link":"http://mikahla.ca","desc":"Sticks and stones may break my bones, but words will never hurt me.’ What a load of crap! \r\n\r\nWords are extremely powerful, and regardless of their literal meaning every word has a separate connotation that evolves overtime. What fascinates me are single words—grenade words—that can be shocking when heard. Many people in North America believe that one of the harshest words in the English language (definitely a grenade word) is the word cunt. This body of work is asking the viewer to question why cunt holds so much power. \r\n \r\nCunt’s earliest meaning was a medical entry in a surgical manual from the year 1400 referring to female genitourinary anatomy1. By investigating why, when, and how the word became a pejorative term, this project proposes how revisiting and utilising the word cunt in its original intended meaning may help move it past its misogynistic history. In so doing, I am striving to increase its approachability and question the potential for reappropriation. \r\n\r\nGermaine Greer did a similar study in the 1970s, striving to defuse Cunt’s meaning. Later in 2007, Greer revoking her position by stating “I don't think now that I want the c-word to be tamed, I love the idea that this word is still so sacred that you can use it like a torpedo, that you can hole people below the waterline.”2 Through my own study I believe that word only holds such power when used as an insult. I believe that the power behind this word is misplaced and that we can reclaim the words power by making it ordinary.\r\n\r\nThrough the culmination of this study’s artefacts, I am hoping people look beyond this singular word and look at other historically offensive words that may also be reappropriated. \r\n","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_6641.jpg?itok=G9k5t-nS, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_6642.jpg?itok=1XEnQf50, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/IMG_6644.jpg?itok=WzhdSLMc, http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/Photo%202.jpg?itok=IqH-KNQV","tags":"Education, Gender, Language, Packaging, Video","project":"Cuntemporary","name":"Mikahla Iuele","nid":"171","profile":""}},{"node":{"email":"jr14lj@student.ocadu.ca","instructor":"isabel","link":"","desc":"Forced Displacement in Colombia is an exploration of Latin America's worst and longest socio-political armed conflict and its impact in the mass migration of people. The topic is presented in three outputs: a timeline describing major events from 1948–2018; a newspaper highlighting stories and tragedies faced by millions of displaced Colombians; and a short film highlighting the transformation of La Sierra Nevada de Santa Marta from a place of intense violence in the 70s, '80s and '90s to a Biosphere Reserve of Man and Humanity today.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/TL%20displaced.jpg?itok=4a951udP","tags":"History","project":"Forced Displacement in Colombia","name":"Julian Restrepo","nid":"170","profile":""}},{"node":{"email":"chenhuisong.design@gmail.com","instructor":"saskia","link":"http://chenhuisong.com","desc":"No. Brainer is an experimental website that aims to provide insight into the impact that Artificial Intelligence (AI) and future technology might have on graphic designers. Many believe AI could replace graphic designers and become a threat to the industry (Shaughnessy). However, through my research I see AI and future technology as being an essential tool for designers.\r\n\r\nSome generative tools for graphic design, and algorithms categorize and re-arrange elements to generate logos (Li). These algorithms are intended to replace traditional logo designers, but what I am interested in is how it can be a tool for designers. I was inspired to use similar logic but to create a tool that would generate rough compositions.\r\n\r\nWhen users visit the website they can input their own set of parameters (elements, and principles of design) or allow the application to input random data. The website will then use its database to generate a number of compositions. Users can then download these compositions as a source of inspiration for their own design. My goal with this tool is to inspire and to spark new ideas rather than provide a design solution.\r\n\r\nThe reason I am building a supportive tool is because I do not believe AI could or should replace human graphic designers. The thought and process behind design is what makes a piece of design valuable. A tool like this can enhance and stimulate the design process rather than take it away. I believe this is how we should develop our technology: to provide a better experience for humans, instead of replacing humans altogether.\r\n","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/no%20brainer%20banner.png?itok=vWFsmkz5","tags":"Artificial Intelligence","project":"No. Brainer","name":"Chenhui Song","nid":"169","profile":""}},{"node":{"email":"boudreauaidan@gmail.com","instructor":"saskia","link":"http://aidanboudreau.com","desc":"Sapere is a study on the medias influence on our taste in the areas of food and fashion. This study was conducted by looking both broadly and in depth at areas where food and fashion overlap and where the media has noticeably suggested what consumer ate and looked at.","images":"http://2019.ocadu-graphic.design/sites/default/files/styles/large/public/s1processbook%20jpegs.jpg?itok=1lBPlFZ8","tags":"Consumerism","project":"Sapere: To Know and To Taste","name":"Aidan Boudreau","nid":"168","profile":""}}]}